travel_budz/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.save
---
INSERT INTO "comments" ("comment", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["comment", "BirthdaWeekend"], ["created_at", "2018-04-13 13:35:39.655246"], ["updated_at", "2018-04-13 13:35:39.655246"]]

  def destroy
    @comment = Comment.find(params[:id])
    @comment.delete
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]