travel_budz/app/controllers/trips_controller.rb

	def index
		@trips = Trip.all
---
SELECT "trips".* FROM "trips"

	def show
		@trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def destroy
		@trip = Trip.find(params[:id])
		@trip.delete
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 3]]

	def create
		@trip = Trip.new(trip_params)
		@trip.save
---
INSERT INTO "trips" ("destination", "date_of_dep", "date_of_arr", "start_city", "end_city", "details", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def update
		@trip = Trip.find(params[:id])
		@trip.update(trip_params)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "trips" SET "start_city" = $1, "end_city" = $2, "details" = $3, "updated_at" = $4 WHERE "trips"."id" = $5  [["start_city", "JFK"], ["end_city", "CDG"], ["details", "Formage?"], ["updated_at", "2018-04-15 22:32:18.757440"], ["id", 27]]