travel_budz/app/controllers/users_controller.rb

  def create
    @user = User.create(email: params[:email], password: params[:password], password_confirmation: params[:password])
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "2"], ["password_digest", "$2a$10$m8rSDqodDuzDDKW3U9AuQuOQsXJD8Z4I8/m8rXNOWzCWmhekLVT.C"], ["created_at", "2018-04-12 18:59:50.774286"], ["updated_at", "2018-04-12 18:59:50.774286"]]